[
    {
        "x": "How is augmented reality being used to enhance museum experiences and engage visitors with interactive exhibits?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How can virtual reality technology be integrated with psychological therapies to create accessible, self-managed interventions for individuals experiencing chronic stress or anxiety?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How can I convert Blender's Eevee materials to Cycles materials using Python scripting?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "How can I create 3 RESTful APIs in Python using Flask that handle user authentication, product catalog, and order management, with each service interacting through a shared database?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "List the top 5 most influential scientists in history.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Given a sentence and a label in Spanish, select the correct answer. There are 2 choices given, out of which only one is correct for a given statement and label. The label of the task is either 'cause' or 'effect'. The output will be the choice which matches the label with the given statement. If the label is 'cause', then the choice which represents the reason of the statement, gives the answer. If the label is 'effect' then the choice which reflects the consequences of the statement is the answer. The output should be the text from the correct choice and not Choice1/Choice2.\n    \nQuestion: Statement: El estudiante reprobó el examen.\nLabel: effect\nChoice 1: No estudió lo suficiente.\nChoice 2: Perdió su beca.\n    \nAnswer: Perdió su beca.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Translate the following sentence from Hindi to Bengali without omitting or adding any information: वह अपने दोस्तों के साथ पार्क में खेल रहा है।  \n\nSolution:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Question: A bookstore sold 150 science fiction novels in the first week of a promotion. In the second week, they sold twice as many novels as the first week, and in the third week, they sold half the combined total of the first two weeks. If the bookstore made a profit of $5 per novel, how much profit did they make from the science fiction novels over the three weeks?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Question: Of the following two sentences, which one is illogical?\nOptions:\n- Sentence A: \"She drank a cup of sand for breakfast.\"\n- Sentence B: \"She drank a cup of coffee for breakfast.\"\n\nAnswer: Sentence A",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Explain the method of enhancing a classic chocolate cake with rare tropical fruits, and share a recipe that includes at least three uncommon tropical ingredients.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What was the origin of the name E*TRADE?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Identify the person's name in the following sentence: \"During the conference, Dr. Emily Carter presented groundbreaking research on renewable energy.\"",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What are the key features that distinguish Tesla's Full Self-Driving (FSD) technology from other autonomous driving systems currently available in the market?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Q: 据报道，日本政府已决定将福岛核电站处理过的废水排入太平洋，这一决定引起了周边国家的强烈反对。\n\nA: It has been reported that the Japanese government has decided to release treated wastewater from the Fukushima nuclear power plant into the Pacific Ocean, a decision that has sparked strong opposition from neighboring countries.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How can I implement a Python script to analyze a dataset of customer feedback and identify recurring themes in complaints about product defects? Additionally, how can I use natural language processing to categorize these defects and prioritize them based on severity? Please provide sample Python code to demonstrate this solution.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Answer the following question given this paragraph:   The human digestive system consists of the gastrointestinal tract plus the accessory organs of digestion. Digestion involves the breakdown of food into smaller and smaller components, until they can be absorbed and assimilated into the body. The process of digestion has three stages: the cephalic phase, the gastric phase, and the intestinal phase.   Q: What are the three stages of digestion?   Choices:  - cephalic, gastric, intestinal  - oral, gastric, intestinal  - cephalic, oral, gastric  - oral, gastric, final  A:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Which one is more suitable for a formal event? Sneakers or oxford shoes?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Convert the following negative customer feedback into a positive review by making minimal changes while keeping the original context: \"The service was slow and the staff seemed uninterested in helping us.\"  \n\nAnswer:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Translate the following complex legal sentence into plain, everyday English without losing its original meaning: \"The party of the first part hereby covenants and agrees to indemnify and hold harmless the party of the second part from and against any and all claims, damages, liabilities, costs, and expenses, including reasonable attorney's fees, arising out of or related to the performance of this agreement.\"",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Arrange the numbers 34, 7, 89, 12, and 45 in ascending order. What is the last number in the new arrangement?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "A text is given in Hindi. Translate it from the Hindi language to the Telugu language. The translation must not omit or add information to the original sentence.\n\nQ: भारत सरकार ने नई दिल्ली में स्वच्छ भारत अभियान के तहत 1 लाख शौचालयों के निर्माण की घोषणा की है।\nA:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Write a 500-word essay discussing the ethical implications of artificial intelligence in healthcare, focusing on patient privacy, algorithmic bias, and accountability. Use MLA style formatting and cite at least three reputable sources to support your arguments.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "[Question] A bookstore has 1200 books in stock at the beginning of the month. During the month, they sell 350 books, and then receive a new shipment of 420 books. At the end of the month, they donate 10% of their remaining stock to a local library. How many books does the bookstore have left after the donation?  \n[Answer] After selling 350 books, the bookstore has 1200 - 350 = 850 books left. With the new shipment, they now have 850 + 420 = 1270 books. They donate 10% of 1270, which is 127 books. So, they have 1270 - 127 = 1143 books left. The answer is 1143.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How does peer influence affect adolescent decision-making?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Explain the difference between a compiler and an interpreter in programming.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Describe three key differences between traditional acupuncture and electroacupuncture, including their respective benefits and drawbacks for treating chronic pain. Additionally, provide tailored recommendations for when each method should be used based on the patient's pain severity and underlying medical conditions.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Name a scripting language that is commonly used for web development and supports asynchronous programming.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What are the main factors influencing the rise of plant-based diets in modern urban societies?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "[Q]: Write a multi-choice question for the following article: Article: Lisa is a 10-year-old girl who loves to read books. Every Saturday, she visits the local library to borrow new books. Her favorite genre is fantasy. This Saturday, she borrowed a book about dragons and finished reading it in just one day. Her mother was surprised and asked how she read it so quickly. Lisa smiled and said, \"I just couldn't put it down!\" \n****\n[A]: Question: Why did Lisa finish the book so quickly?Options:A she didn't like the bookB she read it with her motherC she couldn't put it downD she skipped many pagesAnswer:C",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Create a metaphor to describe the feeling of nostalgia.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How can I configure a 4-term LFSR to generate the sequence 10110100... given the recurrence relation \\(x_{n+4} \\equiv c_0x_n + c_1x_{n+1} + c_2x_{n+2} + c_3x_{n+3} \\mod 2\\)?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "write description for 18k gold plated tennis bracelet",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Head: PersonX feels ___<sep>Tail: because PersonY ignored PersonX\nOutput:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the key factors that influence wage disparities across different industries?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Can you describe the process of creating handmade paper and the materials needed for it?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Why did Tesla introduce its Powerwall battery system?  \nHow did this create value for homeowners?  \nFor the energy grid?  \nHow did this benefit Tesla?  \nCan you think of any other companies that promote energy independence through similar products?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How to change a flat tire on a bicycle?\n\nSuppose I have a list of words as follows:\napple, banana, grape, orange\nHow can I organize these words alphabetically using a JSON data format? The output should be in the format:\n[\n  {\"word\": \"apple\", \"position\": 1},\n  {\"word\": \"banana\", \"position\": 2},\n  {\"word\": \"grape\", \"position\": 3},\n  {\"word\": \"orange\", \"position\": 4}\n]\nCan you provide the code or steps to achieve this using JSON data format?\n\nSamantha: Jake has 6 cows that produce 4 gallons of milk each per day. If Jake sells this milk for $3 a gallon. How much money will he make in 2 weeks if he sells all his milk?.\nMe: Hmmm, let me think. I think this is the detailed solution:\n\nYou have been tasked with creating a secure password reset system for a new online platform. The system must require users to enter a new password that meets the following criteria:\n- Contains at least one uppercase letter, one lowercase letter, one number, and one symbol.\n- Is exactly 12 characters long.\n- Includes a unique symbol that corresponds to the",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Why do cats flick their tails when they're sitting still?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "What should I expect interview questions to be for a biomedical software engineer at a company developing AI-driven diagnostic tools?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Can you explain the impact of the Treaty of Versailles on the political and economic stability of post-World War I Europe?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What are the key factors that influence consumer purchasing decisions in the e-commerce industry, and how can businesses leverage these factors to improve customer satisfaction and loyalty? Provide data-driven insights and case studies to support your analysis.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Passage: The initial release of the game occurred on November 15, 2018, featuring 12 playable characters. The first major update, adding 4 new characters, was launched on March 5, 2019. A second expansion was announced in June 2019 and released on September 20, 2019, bringing the total roster to 20 characters.\n\nQuestion: Based on this passage, how many characters were added in the first major update? Let's give stream of consciousness below.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How do I decode and verify a JWT token in Node.js to access user claims?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What is the population of Tokyo?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "can you break down the key skills needed for a digital marketing specialist role and suggest resources to develop them?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "what is the significance of the sculpture david by michelangelo?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "How does the perception of leadership effectiveness vary between individualistic and collectivistic societies?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Find the longest palindromic substring in the string \"abccbadeffed\".",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Head: firefighter<sep>Tail: rescue a person from a burning building\nOutput:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "A text is given in Hindi. Translate it from the Hindi language to the Tamil language. The translation must not omit or add information to the original sentence.  \n\nQuestion: भारत की समृद्ध सांस्कृतिक विरासत और विविधता हमारी सबसे बड़ी ताकत है।  \n\nAnswer:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "per_employee table has emp_id, name and per_emp_attendance has emp_id, date, status, while adm_emp_punch_records has emp_code, punch_date, punch_time. emp_id and emp_code are the same identifiers. For each date in per_emp_attendance, retrieve the first punch_time as check_in and last punch_time as check_out from adm_emp_punch_records where status is 'Present'. If no punch records exist for that date, display null. Also include weekly off days marked in per_emp_attendance where status is 'Weekly Off'. Write a SQL Server query to return emp_id, name, date, status, check_in, check_out for all records.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Given the sentence \"A woman is holding a leash while walking in the park.\" can we conclude that \"The woman is walking her dog.\"?\nOptions:\n- yes\n- it is not possible to tell\n- no",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can I extract the album name and track duration for Taylor Swift's \"Lover\" from a given music database? Additionally, can you provide Python code to visualize the song's tempo and spectral centroid over time?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Provide 3 examples of plants that reproduce through spores, but each example must be accompanied by a table that includes the scientific classification, preferred growing conditions, reproductive cycle, and common uses. In addition, for each example, provide at least two examples of environmental threats to the species, and describe the adaptations the plant has developed to survive in its habitat. Finally, provide a brief analysis of the evolutionary advantages and disadvantages of spore-based reproduction compared to other strategies such as seed production or vegetative propagation.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Write an official statement from Manchester United FC in summer 2024 announcing the signing of Kylian Mbappé from PSG.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Develop a retro-style arcade game using Unity that features classic shoot 'em up gameplay. Include at least four different types of spaceships with unique weapons and special abilities. Ensure the game includes various enemy waves, power-ups, and a scoring system to encourage replayability. The game should have 10 progressively difficult levels with distinct space environments and epic boss battles. Additionally, the game should feature dynamic sound effects and an energetic soundtrack to enhance the player's experience.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Rewrite the following email to emphasize my experience in graphic design and how it can enhance marketing campaigns, while reducing the focus on my administrative background:\n\n\"Dear Hiring Manager,\n\nI am excited to apply for the Marketing Coordinator position at your company. With over five years of experience in office administration, I have developed strong organizational and multitasking skills that ensure smooth operations in fast-paced environments. \n\nIn my current role, I manage schedules, coordinate meetings, and handle various administrative tasks efficiently. I also have some experience in creating social media graphics and designing promotional materials, which I enjoy doing in my spare time. \n\nAdditionally, my attention to detail and ability to work under tight deadlines make me a great fit for this role. I would love the opportunity to contribute to your marketing team. \n\nThank you for your time and consideration. I look forward to hearing from you soon.\"",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Can you develop a Python script that analyzes customer feedback from an e-commerce dataset, categorizing comments into positive, neutral, and negative sentiments? The dataset includes reviews on product quality, shipping speed, and customer service. Please provide sample code to demonstrate this sentiment analysis.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Does the Green Party's environmental policy influence its support among younger voters?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "If \"A man is reading a book about ancient history.\" does that mean that \"A man is studying modern science.\"?\nOptions:\n- yes\n- it is not possible to tell\n- no Step by step answer:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Extract the hostname between \"Failed to connect to\" and \"on port\" and the timestamp in YYYY-MM-DD format from each error log entry",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "In this task you will be given a string of characters. You should remove all consonants from the given string. Consonants are all letters that are not vowels (i, e, a, u, o). The character 'y' or 'Y' does not count as a vowel.\n\nNow, understand the problem? If you are still confused, see the following example:\nhNarAik\nSolution: aAi\nReason: The consonants in the input 'h', 'N', 'r', 'k' are removed.\n\nNow, solve this instance: kdaiEJnJwEioB",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What is the process for appointing judges to the Supreme Court of India as per Article 124 of the Constitution? Let's do a good job answering this.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Read the given summary of events, and write a longer story which covers everything described in the summary. The story you write should be longer than the summary you read, but should not repeat itself. The story should be made up of sentences which form a cohesive and logical sequence of events, and should be long enough to fill two or more paragraphs. Do not omit any details which were given by the summary. Make the story such that the summary is an accurate characterization of the paragraphs you write. Adding extra details in your story which are not mentioned in the summary is okay as long as they don't contradict anything in the summary.\n\nNow, understand the problem? Solve this instance: After years of saving, my family finally bought a small cottage by the lake, and it has become our favorite escape from the city's hustle and bustle. Every visit rejuvenates us and strengthens our family bonds.  \n\nStudent:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you translate the following sentence into French while preserving the numbers and capitalization: \"She has 3 cats, 2 dogs, and 1 parrot as pets.\"?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Given the sentence \"A man is playing guitar on stage while the crowd cheers.\" is it true that \"The crowd is enjoying the performance.\"?\nOptions:\n- yes\n- no\n- it is not possible to tell",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Generate a question about the following movie plot: A young woman wakes up in a mysterious facility with no memory of how she got there. The facility's director claims she volunteered for a revolutionary experiment to erase traumatic memories, but as she explores, she uncovers disturbing evidence that suggests the experiment has a much darker purpose. With the help of a sympathetic nurse, she must piece together her fragmented memories and escape before the next phase of the experiment begins.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How to implement a transformer model with triplet loss in TensorFlow for text embedding tasks?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Why did Tesla introduce the Powerwall battery system?  \nHow did this create value for homeowners?  \nFor the energy grid?  \nHow did this benefit Tesla?  \nCan you think of any other companies that promote sustainable energy solutions?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Summarize the key advancements in artificial intelligence over the past decade, and explain how these innovations have transformed industries such as healthcare, finance, and automotive.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Design a [ mobile game idea ] that is a puzzle adventure game with a time-travel theme. The game will involve solving historical mysteries by navigating different eras. The game will also have various difficulty levels and unlockable content. Write a design document that includes the following:  \n- Character design and time-travel mechanics  \n- Puzzle types and difficulty progression  \n- Historical settings and accuracy considerations  \n- Monetization and reward systems  \n- Marketing and community engagement strategies  \n- Player progression and replayability features.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Can you please code a simulation of a gyroscopic sensor using Python?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "How does the cultural perception and consumption of fermented foods vary across different regions of the world?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Write a script for YouTube about the life and achievements of Nikola Tesla.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Create a detailed plan for a ten-episode TV series set in a dystopian future where a rogue biotechnology firm secretly engineers a virus that alters human behavior, turning ordinary people into hyper-efficient but emotionless workers. The story follows a rebellious scientist who discovers the truth and teams up with a group of underground activists to expose the conspiracy. The twist at the end of the first episode reveals that the scientist's own memories have been manipulated by the virus. The midseason climax occurs when they uncover that the firm's CEO is actually an early test subject who now controls the company from the shadows, using the virus to build a subservient workforce.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Name the eight planets in our solar system in order from the Sun.  \n\nQ: Paragraph- Sent 1: The museum exhibit showcases artifacts from ancient civilizations.  \nSent 2: Among the artifacts is a well-preserved Egyptian sarcophagus.  \nSent 3: Visitors can also see Roman coins and Greek pottery.  \nSent 4: A special section is dedicated to Mesopotamian cuneiform tablets.  \nSent 5: The exhibit runs until the end of the month.  \nQuestion: What type of artifact is specifically mentioned from Egypt?  \nCorrect Answer: A sarcophagus.  \nA:  \n\nQ: Where would you most likely find a bookshelf? - kitchen - library - garage - bathroom - swimming pool  The best answer is  \nA: library  \n\nQ: Given the following quotes, compose a short poem that weaves them together.  \n\"'laughter is the best medicine'  \n'silence is golden'  \n'patience is a virtue'\"  \n\nPlease draft a detailed residential lease agreement for a single-family home, covering essential terms such as lease duration, rent amount and due date, security deposit, maintenance responsibilities, and tenant obligations. Ensure the agreement is legally sound, clearly worded, and professionally formatted.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Can you create a [spreadsheet] listing examples of intransitive verbs similar to \"fall\" and their appropriate usage in various contexts? Also, could you explain how the usage of \"fall\" differs from that in the given prompt? Lastly, can you rephrase the sentence \"The leaves slowly fell onto the dew-covered grass at dawn\" using a more precise form of the verb \"fall\" in the given scenario? Please include the [spreadsheet] code for reference.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Evaluate a peer-reviewed research article from a reputable medical journal that investigates the relationship between sleep duration and metabolic disorders in middle-aged individuals. In your critique, analyze the study design, participant demographics, data collection methods, and statistical approaches. Highlight any strengths, weaknesses, or biases in the research, and propose recommendations for further studies to address unanswered questions in this field. Your evaluation should be structured logically and present a balanced interpretation of the findings.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "[Q]: In which city is the headquarters of the European Space Agency located?  \n****  \n[A]:",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "What is L-arginine?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Solve the following \"River Crossing\" puzzle with the following rules:\n1. Only two people can cross the river at a time.\n2. They must have a flashlight to cross, and there is only one flashlight.\n3. The flashlight cannot be thrown back; it must be carried by someone returning.\n\nYou have four people who need to cross the river: Alice (can cross in 1 minute), Bob (2 minutes), Carol (5 minutes), and Dave (10 minutes). When two people cross together, they move at the speed of the slower person. The goal is to get all four people to the other side in the minimum possible time.\n\nPlease find the optimal sequence of crossings. You may first analyze the problem, then provide the solution step-by-step, indicating who crosses and who returns at each step, and the total time elapsed.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Create a LinkedIn post about Work-Life Balance. Provide at least 25 practical tips. Separate each tip with spaces and include a unique icon for each tip",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Write a job application letter as if written by Mr. Daniel Carter. He is applying to Bright Minds Publishing for a position as a graphic designer. Bright Minds specializes in creating educational materials for children, including illustrated books and interactive digital content.\n\nDaniel is a 28-year-old British citizen living at 45 Maple Lane in Bristol. He recently graduated with a bachelor's degree in graphic design from the University of the West of England. He has been freelancing for small businesses but is now looking for a stable role where he can contribute his creativity and design skills.\n\nBefore pursuing his degree, Daniel worked for 4 years as a marketing assistant at Green Earth Organics, where he developed promotional materials and managed social media accounts.\n\nDaniel enjoys painting, playing the guitar, and volunteering at local schools to teach art to children. He is passionate about education and would love to work for a company that makes learning fun and engaging for kids.\n\nDaniel has the right to work in the UK.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Create a step-by-step guide on how to implement a machine learning model to predict customer churn, including data preprocessing, feature selection, model training, and performance evaluation metrics.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What software and configurations are required to set up a local development environment with Apache, MySQL, and Python 3.9?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Extract the answer to the following question from the movie plot. If the question isn't answerable, please output \"Can't answer\". Question: What does Fuad plan to use the body parts for? Title: Blood Feast Movie plot: In the midst of a series of gruesome murders, a young woman is killed inside her suburban Miami house by a grey-haired, wild-eyed man. He stabs her in the eye and hacks her leg off with a machete, bagging the leg before he leaves. At the police station the next day, detective Pete Thornton investigates the killing, noting that it is the latest in a series of four murders by a homicidal maniac who has yet to leave any clues. The police chief advises him to continue to pursue the case. At Fuad Ramses Catering store, wealthy socialite Dorothy Fremont arrives, where she arranges for Fuad to cater a party for her daughter Suzette. Fuad agrees and tells Mrs. Fremont that the Egyptian feast that he is preparing has not been served for over 5,000 years. Mrs. Fremont wants the catering done in two weeks, and Fuad assures her that he will have enough time to procure the last of his needed ingredients. After Mrs",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Who holds the current world record for the men's 100-meter sprint?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "You are a detective investigating a theft at a museum. Here are the clues you've gathered:\nClue 1: The security footage shows a shadowy figure exiting through a window just before the alarm sounded.\nClue 2: A faint smell of sulfur was detected near the stolen artifact's display case.\nClue 3: A note was left behind with the words \"the devil's handiwork\" scrawled on it.\nBased on these clues, can you determine who committed the theft? Provide your reasoning and conclusion.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How can I implement a Python script to read and process a CSV file containing employee data, calculate their average salary by department, and generate a bar chart visualization using matplotlib? Additionally, include error handling for missing or incorrect data and demonstrate how this script could be integrated into a larger HR management system.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What is the average distance between the Earth and the Moon?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "In a JSON file that contains information about movies, what are the titles of two movies that have a rating of 5 stars? The JSON data format is structured as follows:\n{\n  \"movies\": [\n    {\n      \"title\": \"Inception\",\n      \"rating\": 5\n      ...\n    },\n    {\n      \"title\": \"The Shawshank Redemption\",\n      \"rating\": 5\n      ...\n    },\n    {\n      \"title\": \"The Dark Knight\",\n      \"rating\": 4\n      ...\n    },\n    ...\n  ]\n}\nPlease provide the titles of two movies that have a rating of 5.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Considering the traffic laws in your area that prohibit driving above 100 km/hr, determine the average speed given the total distance covered is 350 km and the time taken was 5 hours. Show your step-by-step reasoning to justify your answer.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "what is the cost function used in logistic regression?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How did Audrey Hepburn's distinctive style and acting versatility contribute to her legendary status in film history?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Generate 5 \"would you rather\" questions about ethical dilemmas in technology.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How can I design a relational database schema for an online bookstore that includes books, authors, publishers, and customer orders?  \n\nWhat key tables and relationships should be included to efficiently store book details, pricing, inventory, and customer order history?  \n\nHow can I use SQL queries to retrieve books by genre, author, or bestsellers, and implement search functionality with filters like price range and ratings?  \n\nCan you provide an example of SQL code to create these tables, insert sample data, and query the database for a customer’s order history and recommended books based on past purchases?  \n\nHow can I optimize the database for performance when handling large volumes of book data and frequent customer searches?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Using at least two different statistical methods, compare the effects of remote work on productivity and job satisfaction between employees in the tech industry and those in the healthcare sector. Additionally, evaluate how these effects vary based on company size and employee seniority. Finally, discuss the potential implications of these findings for future workplace policies and employee well-being.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Part 1. Definition  \nYou are given a sentence in French. Your job is to translate the French sentence into English.  \nPart 2. Example  \nC'est le plus beau paysage que j'aie jamais vu.  \nAnswer: It's the most beautiful landscape I've ever seen.  \nExplanation: The French sentence is correctly translated into English, preserving the original meaning.  \nPart 3. Exercise  \nComment savez-vous que c'est le bon moment ?  \nAnswer:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Develop a dialogue between a software engineer and a graphic designer discussing the integration of user experience (UX) principles into a mobile app development project. Additionally, include a table comparing the effectiveness of different UX design patterns based on user engagement metrics. Finally, provide snippets of code that illustrate how responsive design can be implemented using CSS frameworks.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "You can only get answer from the choices I give. But try to explain your choice. The old bridge stood strong for decades, but time had caused it to slowly what? Make the most suitable choice from these: expand, crumble, rise, strengthen, glow",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "What is Twitter: a) Social media platform b) Cooking show c) Type of bird d) Car model e) Magazine  \n\nDiscuss the role of online communities in providing emotional support for parents of children with autism.  \n\nGiven a list of numbers, sort them in descending order.  \n-7, 23, 0, 45, -12  \n\nCan we conclude from \"A woman is reading a book under a tree.\" that \"She is studying for her final exams.\"?  \nOptions:  \n- yes  \n- no  \n- it is not possible to tell  \n\nWrite a comparison essay of at least 500 words on working remotely versus working in an office, focusing on productivity, work-life balance, communication, and job satisfaction. Your essay should be structured with an introduction, body, and conclusion, and should include at least 3-4 specific examples or experiences to support your arguments. Pay close attention to sentence structure, grammar, and use of evidence to ensure a clear and coherent essay.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Definition: You will be given a sentence containing a pronoun/person name and an action. From these implicit parameters, the main goal is to determine the profession of the person (e.g., teacher, doctor, engineer).\nInput: My sister performed surgery on the patient with great precision.\nOutput:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Can you explain what this means 'Black leather harness vest with adjustable straps and metal buckles for women'?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Analyze the narrative techniques used by J.K. Rowling to develop character arcs in the Harry Potter series, focusing on at least three main characters. Provide specific examples from the books to illustrate how their growth is portrayed through dialogue, actions, and interactions with other characters. Additionally, discuss how these techniques contribute to the overall themes of the series.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "how to implement the verifyMAC method in HMAC SHA-256 for data integrity",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Which of these sentences is grammatically incorrect?\nOptions:\n- Sentence A: \"She don't like apples.\"\n- Sentence B: \"She doesn't like apples.\"",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Describe the topic under \"---\".\nObserve the options below.\n- Style: Exactly  \n- Reader level: expert  \n- Length: 2 pages  \n- Perspective: Data Scientist  \n- Please answer in English  \n---  \nWe are building a sentiment analysis model for customer reviews in German.  \nThe dataset includes train.csv (review text in column 1, sentiment labels 0-4 in column 2) and test.csv (unlabeled reviews).  \nUse BERT multilingual model with fine-tuning to predict sentiment for the test set.  \nOptimize hyperparameters including learning rate, batch size and epochs.  \nOutput should be a CSV file with predicted labels.  \nProvide the full implementation code using PyTorch.  \n\nWe use these modules:  \nimport pandas as pd  \nimport torch  \nfrom transformers import BertTokenizer, BertForSequenceClassification  \nfrom sklearn.metrics import accuracy_score  \nAnswer in English.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "\"Paris Saint-Germain\", given a list of categories: company, educational institution, artist, athlete, office holder, mean of transportation, building, natural place, village, animal, plant, album, film or written work, what category does the title belong to?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "How can I implement a secure authentication system using JSON Web Tokens (JWT) in a Node.js application?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What is the capital city of Australia?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Premise: \"A man is standing on a street corner holding a leash while a dog sits beside him.\"  \nHypothesis: \"The man is walking his dog.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- it is not possible to tell  \n- no",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you identify four online platforms where users can trade cryptocurrencies without a centralized intermediary? Think beyond traditional exchanges!",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Can you share a recipe for a Small Batch Chocolate Chip Cookies for a cozy night in?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Q: نظر این کاربر در مورد بازیگران فیلم \"متری شیش و نیم\" چیست؟<sep>Review: بازی علی مصفا در این فیلم واقعا خیره کننده بود و نقش آفرینی بی نظیری داشت. اما بازی نگار جواهریان کمی ضعیف بود و نمی‌توانست با نقشش ارتباط برقرار کند. بقیه بازیگران هم عملکرد متوسطی داشتند.\nA:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Create a pixel art dungeon crawler game using Unity where players can choose between four distinct character classes (warrior, mage, rogue, cleric), each with unique skills and equipment. The game should feature procedurally generated dungeons, turn-based combat, and a crafting system for weapons and potions. Include at least 20 different enemy types, 5 boss battles, and a storyline with multiple endings based on player choices. The game must also support local co-op multiplayer for up to 4 players. Ensure the UI is intuitive and the controls are responsive on both PC and console platforms.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Write a 400-word passage in the style of J.D. Salinger about a father and daughter visiting an old bookstore. The daughter, age 16, discovers a first edition of her father's favorite novel hidden in the stacks, but as she reaches for it, a stranger's hand grabs it first. Describe the tension as they lock eyes over the book, her father oblivious to the silent battle happening behind him. The stranger smirks and walks away with the book before she can react. How does she confront her father about the missed opportunity?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the key themes and literary contributions of Victoria McArtor as highlighted on her personal website?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Can you recommend effective methods for parents to encourage creative problem-solving skills in their children at home?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Q: Context: The novel \"To Kill a Mockingbird\" was written by Harper Lee and published in 1960. It won the Pulitzer Prize for Fiction in 1961 and has become a classic of modern American literature. The story is set in the 1930s and addresses serious issues like racial injustice and moral growth.\n\nQuestion: who wrote the novel \"to kill a mockingbird\"?\nA:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Q: Name the famous amusement park located in Orlando, Florida, known for its magical theme and iconic castle?  \n-----\nA: disney world",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Analyze the ethical implications of using artificial intelligence in predictive policing, considering both potential biases in data and impacts on civil liberties.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Compare the Apollo and Soyuz space programs in terms of mission objectives, technological advancements, and geopolitical impact, and discuss how their collaboration influenced future international space endeavors.",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "How do I implement a dark mode toggle in a React application using Tailwind CSS?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How do I redirect the subdomain at blog.example.com to https://blog-platform-123.azurewebsites.net/?\n\nOR  \n\nThe cat was startled because the house smelled unfamiliar. The furniture was the same, the toys were the same, but something was off. Where did the cat come from?  \nOptions:  \n- shelter  \n- neighbor's house  \n- alley  \n- wild outdoors  \n- pet store  \n\nOR  \n\nCreate a themed gift basket for a coffee enthusiast that includes specialty coffee beans, a French press, a coffee grinder, a travel mug, biscotti, and a book about coffee brewing techniques.  \n\nOR  \n\nFacts:  \n- instrument: drums bass guitar  \n- website: www.janedoe-music.com  \n- years active: 2005 -- present  \n- birth name: jane marie doe  \n- genre: indie rock alternative  \n- birth date: 15 march 1988  \n- name: jane doe  \n- background: band_member  \n- birth place: usa portland oregon  \n- associated acts: the echoes solo  \n- occupation: musician songwriter  \n\nWrite a short biography describing the life of jane doe.  \n\nOR  \n\nhow correlated are nasdaq and russell 2000?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "You are a software architect designing a cloud-native microservices application. The application will be deployed across multiple regions and must handle high availability and disaster recovery. Outline the key components and strategies you would implement to ensure resilience and scalability, including how you would manage data consistency and service discovery.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "What steps should I follow to properly season a cast iron pan to prevent food from sticking?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Write a script for a podcast episode discussing the evolution of hip-hop music. Include interviews with artists, insights into key historical moments, and predictions for the genre's future. Use sound clips to enhance the discussion.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What role did radar technology play in the success of the D-Day invasion?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "1. Tell me about anxiety symptoms: causes, effects. Over 1000 words in numbered formats.  \n2. Share real-life stories of people who experienced anxiety and how they overcame it (over 1000 words).  \n3. Based on the above, craft detailed and compelling book chapters (3 types) on anxiety (over 1000 words).  \n4. After that, using number 3, write a sample manuscript for the first chapter (over 2000 words).  \n5. Generate 50 bestselling book title ideas.  \n6. Write a press release announcing the book.  \n7. Create a compelling blog post with relevant hashtags.  \n\n*(Each answer should be bolded and clearly marked.)*  \n\nWrite in a creative, engaging style. Use numbering formats.  \nWrite in English.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Continue this backstory: Kaelith was abandoned by her elven kin when she was found to possess the rare ability to communicate with shadows, a trait considered an abomination among the Moonlit Court. Legends speak of this power as a sign of the Shadow Weave's return, an ancient force that once threatened to consume the world. Fearing her as a harbinger of doom, her people cast her out, expecting the wilds to claim her. Yet Kaelith survived, learning to harness her gift as she wandered the lands, seeking a way to prove her worth and find true allies. During her travels, she was ambushed by a pack of shadowbeasts drawn to her power. Overwhelmed, she was nearly consumed until [player's character] intervened, wielding light magic to drive the creatures away. Grateful, Kaelith pledged her loyalty as a guide through darkness, forming a bond of light and shadow. Together, they journey to the Forgotten Vale, where rumors speak of a hidden sanctuary for those touched by the Shadow Weave, offering answers—or perhaps redemption.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How does the Coriolis effect influence the rotation direction of tropical cyclones in the Northern and Southern Hemispheres?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "can you provide me with a list of major film studios in Europe that primarily use CGI or practical effects in their productions?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Can you craft a satirical poem in response to \"Cómo, Cuomo?\" that highlights the governor's policies from a supportive viewpoint?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How can I adapt this ESPHome configuration for an ESP32 if I'm currently using it with an ESP8266 NodeMCU?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "[Q]: Problem: the perimeter of a rectangle is reduced by 15%. By what percentage would each side have to be increased to maintain the original perimeter?\nOptions: a) 7.5%, b) 10%, c) 12.5%, d) 15%, e) 17.5%\n[A]:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How is the performance of a lead software developer evaluated in a tech company? What key performance indicators might they focus on improving?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Who won the Best Supporting Actress award at the Golden Globes in 2018 for their role in \"This Is Us\"?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the requirements for obtaining a work visa in Japan?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "What are the daily responsibilities of a digital marketing specialist?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the ecological impacts of introducing non-native plant species to a local ecosystem?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Who was the first manager to lead Manchester United F.C. to a European Cup victory?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Write content for a 4 slide deck for TechSolutions Inc., that covers the following 4 aspects. First, highlight the expertise of the AI Innovation Lab, including a Machine Learning project for ClientA using TensorFlow and a NLP project for ClientB using PyTorch. Second, detail our Collaboration framework with key partners like Google Cloud and Microsoft Azure. Third, showcase our 3 flagship products for Predictive Analytics, Chatbot Development, and Image Recognition. Fourth, include a testimonial from a major client praising our deliverables.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the key terms of the settlement announced by Internet Archive and Suzanne Shell on April 25, 2007?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Write a Python script to classify images of cats and dogs using a pre-trained VGG16 model and output the accuracy score.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What are some essential tools and techniques that architects use to design sustainable buildings, considering environmental impact and energy efficiency? Can you provide a Python code example to simulate the energy performance of a building design, incorporating factors like insulation, solar gain, and ventilation?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Can you design a function that smoothly transitions values from 0 to 1, with an initial slow start, a linear middle section, and a gradual slowdown at the end?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How many offices does Charter Broadcast have outside of Britain, and what major sporting events have their clients been involved in broadcasting?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How does the Vatican's Apostolic Palace function as a representation of the Pope's spiritual and temporal authority?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Can you suggest three highly specialized and challenging job positions that demand a combination of advanced technical expertise and exceptional leadership skills in the fields of biotechnology, artificial intelligence, or quantum computing? The suggested job positions should require a multi-step thought process and detailed analysis. Furthermore, can you provide a complex and sophisticated shell command that can be utilized to conduct a comprehensive search for job listings that perfectly align with these specific and specialized requirements on a selected job board or search engine, which involves intricate coding techniques and advanced search algorithms?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Can you create a detailed backstory for my fictional Italian chef Sofia who owns a small trattoria in Tuscany?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can I ensure that my YouTube video description is optimized for search engines and includes all relevant keywords?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How can I calculate the total sales revenue for a list of items in Python? Let's say I have 10 books at $20 each, 5 notebooks at $10 each, and 8 pens at $5 each. Can you provide a multi-step solution that involves writing a Python script to compute the total revenue?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What were the key technological advancements during the Industrial Revolution, and how did they transform manufacturing and transportation systems?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "how many 3 star reviews does \" starbucks \" have?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "[Question] A box of apples weighs 15 pounds, and a crate of oranges weighs 12 pounds. If Miguel buys 5 boxes of apples and 3 times as many crates of oranges, how many pounds does he have to carry?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Rewrite the following job application and place greater emphasis on my experience with AI-driven customer service chatbots and how this expertise can enhance efficiency in the banking sector, while reducing focus on my previous retail management roles.  \n\n\"Dear Hiring Team,  \nI am excited to apply for the Customer Experience Manager position at Global Bank. With a strong background in retail management, I have successfully led teams of up to 50 employees, optimized store operations, and improved customer satisfaction scores by 20% within six months. My ability to analyze sales data and implement strategic improvements has consistently driven revenue growth.  \n\nAdditionally, I have a keen interest in technology and have independently studied AI applications in business. I believe integrating AI-driven chatbots could streamline customer inquiries and reduce response times in banking. My experience in problem-solving and team collaboration would allow me to contribute effectively to your digital transformation goals.  \n\nIn my previous role as a Store Manager at Bright Retail, I also handled inventory management, staff training, and vendor negotiations. I thrive in fast-paced environments and am adept at multitasking under pressure.  \n\nI would welcome the opportunity to discuss how my skills align with Global Bank’s vision. Thank you for your time and consideration.\"",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the advantages of meticulous planning when traveling, and in what scenarios would you suggest this method over a more spontaneous approach?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Is the painting of the ocean displayed in the gallery while the sculpture is placed in the garden?\nA: yes",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Given a short story about a student who accidentally spills coffee on their classmate's project and then offers to help fix it, analyze the likely emotions and motivations behind their actions. Write your answer in the form \"A >Motivates> B\" using the verbs: feel(s), want(s), or like(s). The chosen sentence is: \"The student offered to help fix the ruined project.\"",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Question: A bakery sells three types of cakes: chocolate, vanilla, and strawberry. They sold 50 chocolate cakes, which is twice as many as vanilla cakes, and the strawberry cakes sold were half the number of chocolate and vanilla cakes combined. If each cake costs $15, what was the total revenue from all cake sales?\nAnswer: Step-by-step reasoning process: Vanilla cakes sold were 50 / 2 = 25. Chocolate and vanilla cakes combined were 50 + 25 = 75. Strawberry cakes sold were 75 / 2 = 37.5 (rounding to 38). Total cakes sold were 50 + 25 + 38 = 113. Total revenue was 113 x $15 = $1695.\nSo the answer is 1695.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What is the probability of rolling two six-sided dice and getting a sum of 7?\n\nOption A: 1/6  \nOption B: 1/12  \nOption C: 1/18  \nOption D: 2/9  \nOption E: 1/36",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you explain the symbolism behind the use of a broken mirror on the cover of a poetry collection titled 'Fragmented Reflections'?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Premise: \"A cat is sleeping on the windowsill.\"  \nHypothesis: \"The cat is resting.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- it is not possible to tell  \n- no",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "[Q] Premise: \"A group of students is working on a science project in the school lab, carefully measuring chemicals and taking notes.\"  \nHypothesis: \"The students are conducting an experiment in the lab.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- no  \n- it is not possible to tell  \n[A] A group working on a science project while measuring chemicals and taking notes implies they are conducting an experiment.  \nThe answer is yes.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Q: A case report describes a patient experiencing severe hepatotoxicity after prolonged use of isoniazid for tuberculosis treatment. Classify this as a non-adverse drug event or an adverse drug event.  \nA:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Detect whether this text is hawkish or dovish monetary policy: The central bank has signaled it may pause interest rate hikes amid concerns over slowing economic growth and rising unemployment. Inflation remains below target, suggesting room for further stimulus if needed.  \n\n(Note: The question follows the same structure and complexity as Example 1, focusing on detecting monetary policy tone from a given economic context.)",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the key differences between symmetric and asymmetric encryption in cryptography?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the most effective digital marketing campaigns for e-commerce businesses based on data from a MySQL database?\n\nUsing data from the \"marketing_campaigns\" table, which contains the following columns: campaign_id (INT), campaign_name (VARCHAR), conversion_rate (FLOAT), and roi (FLOAT), what are the top three campaigns with the highest conversion rate and highest return on investment (ROI)?\nPlease provide the list in bullet points in markdown format.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the common types of fossils found in sedimentary rocks?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Using case studies and psychological research, critically examine the impact of remote work on employee productivity and job satisfaction. Consider factors such as work-life balance, communication challenges, and the role of workplace culture in shaping these outcomes. Additionally, explore any potential benefits of remote work, such as increased flexibility and reduced commuting stress. Provide evidence-based recommendations for employers to optimize remote work policies and support employee well-being.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Translate the following Chinese sentence into Japanese and then paraphrase the Japanese translation while keeping the original meaning: \"去年夏天，我们全家去了北海道旅游。\"",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the key components of a Python script that interacts with a MySQL database to fetch and display data?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Plan a weekend getaway in San Francisco, arriving Saturday morning and departing Monday evening, for a group of three friends interested in outdoor activities.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What economic, ethical, and technological challenges might emerge from the widespread adoption of artificial intelligence in healthcare?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "You can only get answer from the choices I give. But try to explain your choice. After the storm passed, the broken branches would never what?. Make the most suitable choice from these : burn, grow back, fly, disappear, float",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "[Question]A grocery store sells apples in bags of 5 and oranges in bags of 3. If a customer buys 4 bags of apples and 2 bags of oranges, how many pieces of fruit do they have in total?  \n[Answer]The customer has 4 * 5 = 20 apples and 2 * 3 = 6 oranges. In total, they have 20 + 6 = 26 pieces of fruit. The answer is 26.  \n\n[Question]Tom can read 12 pages of a book in an hour. If the book has 360 pages and he reads for 5 hours a day, how many days will it take him to finish the book?  \n[Answer]Tom reads 12 * 5 = 60 pages per day. To finish 360 pages, it will take 360 / 60 = 6 days. The answer is 6.  \n\n[Question]A bakery sells cupcakes at $2 each and cookies at $0.50 each. If Sarah buys 8 cupcakes and 12 cookies, how much does she spend in total?  \n[Answer]Sarah spends 8 * $2 = $16 on cupcakes and 12 * $0.50 = $6 on cookies",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "[Q]: the court held that the previous ruling in smith v. jones was no longer valid due to new legislative changes and established a different legal standard for future cases.  \n[A]:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Why does deforestation lead to loss of biodiversity?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How did the Bauhaus movement revolutionize modern design in the early 20th century, particularly through its emphasis on functionality, minimalism, and the integration of art and technology? Consider its impact on architecture, furniture design, graphic arts, and industrial production, as well as its lasting influence on contemporary design principles.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What steps should be followed to ensure the water temperature stays between 190°F and 200°F when preparing tea, given the following clues:\n- If you add 5 and 5, you should \"boil\" the water.\n- If you subtract 4 from 8, you should \"steep\" the tea.\n- If you multiply 2 by 3, you should \"pour\" the water.\n- If you divide 12 by 4, you should \"add\" the leaves?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Create an addon for World of Warcraft that tracks and displays a player's progress toward completing all dungeon achievements in a customizable UI window using LUA and the WoW API.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the key differences between classical and operant conditioning?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "[A]: metformin, rifampicin, isoniazid, ethambutol",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Analyze this debate using a 5-point rubric. Grade and score each: Clarity of arguments, use of credible evidence, logical consistency, engagement with opposing views, and overall persuasiveness.  \n\n**OR**  \n\nWrite a comparative analysis of at least 600 words on remote work versus in-office work, focusing on productivity, work-life balance, employee satisfaction, and long-term career growth. Your analysis should include an introduction, structured body paragraphs with clear transitions, and a conclusion. Support your arguments with at least 4-5 credible sources or real-world examples, ensuring proper citation and coherence.  \n\n**OR**  \n\n\"Create an 'imagine prompt' for a text-to-image AI tool (e.g., Stable Diffusion) using the following structure:  \n1. **Subject**: Replace with a user-provided concept, described in vivid detail using sensory language, metaphors (if necessary), and active verbs.  \n2. **Setting**: Define the environment concisely, emphasizing mood, textures, and spatial composition.  \n3. **Atmosphere**: Describe emotional tone (e.g., eerie, serene) with precise adjectives.  \n4. **Lighting**: Specify light type (e.g., diffused, neon), direction, and color temperature.  \n5.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What is the volume of a cylinder with a radius of 3.5 and a height of 7.2? Please answer with 8 significant digits.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What is the sum of the digits in the binary representation of the number 42?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "answer this question based on the context, and if you don't know say I don't know.  \nQ: My daughter is in a Montessori program for 4-year-olds—does this qualify as 'early childhood education' for the Bright Start subsidy?  \nContext: The Bright Start subsidy is available for children enrolled in:  \n• Licensed daycare centers  \n• Accredited preschool programs  \n• Registered early childhood education providers  \nMontessori programs must be accredited by the National Early Childhood Association to be eligible.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Can you explain the \"Online Wealth Institute\" scam and how it deceives people with false promises of financial freedom? Answer according to: Online Wealth Institute Exposed – Another Get-Rich-Quick Scheme.  \n\n(Note: This question mirrors the structure and topic of Example 1, focusing on exposing a scam with detailed allegations and proof.)",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "What are some equations that represent the benefits of renewable energy? Could you provide a set of equations as an example?  \n\nHere are some equations that can be used to describe the benefits of renewable energy:  \n1. Energy Efficiency = (Reduced Carbon Emissions) + (Sustainable Resource Use)  \n2. Cost Savings = (Lower Operational Costs) – (Initial Investment)  \n3. Job Creation = (Number of Green Jobs) × (Economic Growth)  \n4. Energy Independence = (Local Resource Utilization) + (Reduced Fossil Fuel Imports)  \n5. Environmental Protection = (Biodiversity Conservation) + (Pollution Reduction)  \n\nYou can use these equations to quantify the benefits of renewable energy in different sectors.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "I require your assistance to draft some articles about the Domestic Building Contracts Act in the context of residential construction in Victoria, Australia. For now, just acknowledge my message.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Design a [board game concept] that is a cooperative survival game set in a post-apocalyptic world. The game will feature resource management, character progression, and dynamic event cards. Write a design document that includes the following:  \n- Character roles and progression systems  \n- Core gameplay mechanics and win/loss conditions  \n- Game board and environment design  \n- Expansion and replayability strategies  \n- Target audience and playtesting plan  \n- Production and distribution considerations.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How did the Apollo Program compare to the Gemini and Mercury programs in terms of technological advancements, mission objectives, and astronaut training, and what were its key achievements and shortcomings?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Online platform for freelance tutors: Many students need personalized tutoring, but there's no centralized place to find qualified tutors in various subjects. A website that connects tutors with students could solve this problem. \n\nyou gave me this business idea. how can i start this?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Where is the Taj Mahal located in India?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Generate a question about the following movie plot: A struggling artist in New York City accidentally swaps his portfolio with a famous art dealer's confidential client list at a crowded gallery opening. As he tries to locate the dealer to return the list, he becomes entangled in a high-stakes art forgery scheme involving the dealer and a notorious underground art syndicate. Meanwhile, the artist's roommate unknowingly uses the client list to secure high-profile commissions, leading to a series of escalating misunderstandings and dangerous encounters.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What factors could influence the accuracy of a market research survey when conducted across diverse age groups?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Given two strings A and B, perform the following operations: (i) Find the longest common subsequence in the strings A and B, (ii) Convert this subsequence to all uppercase and reverse its order, (iii) Replace the subsequence at its respective positions in the two strings with the updated subsequence. \n\nPROBLEM: kLmNoPqRsTuVwXyZ, aBcDeFgHiJkLmNoP\n\nSOLUTION:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How can a manufacturing facility integrate biodegradable materials into its production line to reduce plastic waste while maintaining product durability?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "What are some natural ways to relieve stress and anxiety at home?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "how to encrypt a file without using openssl or gpg",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Design a distinctive logo for a tech startup that embodies innovation, connectivity, and forward-thinking. The logo should integrate modern design elements, such as sleek lines, minimalist aesthetics, and digital-inspired motifs, to reflect the company's cutting-edge technology solutions. Ensure the logo is versatile enough for use on various platforms, including websites, business cards, and promotional materials.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "[EX Q]: و اینک من با شما هستم هر روز تا انقضای عالم.  \n[EX A]: And surely I am with you always, to the very end of the age.  \n\n[EX Q]: چون که خدا جهان را اینقدر محبت نمود که پسر یگانه خود را داد تا هر‌که بر او ایمان آورد هلاک نگردد بلکه حیات جاودانی یابد.  \n[EX A]:  \n\n[EX Q]: زیراخداوندخدا آفتاب را برای حکومت روز و ماه و ستارگان را برای حکومت شب قرار داد.  \n[EX A]:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Write a step-by-step guide on how to brew the perfect cup of pour-over coffee, including instructions on selecting the right coffee beans, grinding them to the appropriate consistency, and measuring the correct coffee-to-water ratio. Additionally, provide details on water temperature, pouring techniques, and brewing time, along with tips for achieving optimal flavor extraction. The guide should cater to both beginners and experienced coffee enthusiasts, offering clear and actionable advice.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Translate the following sentence from the Quran into French:\n\"Indeed, Allah is with the patient.\"",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "**Q**\nIs the following a factual statement?\n\"The Amazon River is the longest river in the world.\"\nOptions:\n- yes\n- no\n**A**",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Q: A bookcase has 5 shelves, each holding 12 books. If each book is 1.5 inches thick, what is the total length occupied by the books if they were laid end to end?  \nA:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Identify the named entities (NER) in the given recipe ingredients, excluding quantities.\n\nInput: 1 cup all-purpose flour, 1/2 cup granulated sugar, 1/4 cup unsweetened cocoa powder, 1 tsp baking powder, 1/4 tsp salt, 1/2 cup milk, 1/4 cup vegetable oil, 1 egg, 1 tsp vanilla extract, 1/2 cup semi-sweet chocolate chips",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Convert the following sentence with digits into their text equivalents: \"The meeting is scheduled for March 15, 2024, at 3:30 PM in Room 205.\"",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How do I plan a corporate retreat that boosts team morale and collaboration without making it feel like mandatory fun? Provide actionable tips and key elements to include.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What role did the printing press play in the spread of Renaissance ideas?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "There are two groups of people in a park. One group has 15 children. The second group has 12 adults. A child is defined as a human being under the age of 12, while an adult is 12 or older. How many total arms are there among both groups? Explain your reasoning.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "how do i execute a bash script from within ansible that requires user input during runtime?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Premise: \"A child is building a sandcastle on the beach.\"  \nHypothesis: \"The child is playing in the snow.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- it is not possible to tell  \n- no  \nTeacher's response: Let's think. The premise describes a beach activity, while the hypothesis mentions snow, which contradicts the setting. The answer is no.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "morse code example:\n.... . .-.. .-.. --- -> hello\n.-- --- .-. .-.. -.. -> world\n.... --- .-- -> how\n.- .-.. .-.. -> all\n.- .-. . ->",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Who was the first person to walk on the moon?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Answer the following question given this paragraph:   The Earth's atmosphere is composed of several layers, each with distinct characteristics. The troposphere, the lowest layer, contains about 75% of the atmosphere's mass and is where most weather phenomena occur. The stratosphere, located above the troposphere, contains the ozone layer that absorbs harmful ultraviolet radiation.   Q: Which layer of the atmosphere contains the ozone layer?   Choices:  - troposphere  - exosphere  - mesosphere  - stratosphere  A:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Act like a security auditor, help me assess this login page: \"https://example.com/login\" with criteria:\nPassword strength requirements\nRate limiting for failed attempts\nSession timeout settings\nHTTPS enforcement",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Q: Given a prompt and a response, classify the response as \"agree\" if it aligns with and expands upon the prompt's idea, or \"disagree\" if it contradicts or ignores the prompt.  \nPrompt: Let’s plan a beach party for the weekend.  \nResponse: We could also bring a barbecue grill and have a bonfire at sunset.  \nA:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can hospitals in rural areas of India enhance their revenue streams and operational efficiency?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "How do you optimize Nginx configurations for high traffic websites? Provide an example Nginx config file.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Which one absorbs more sunlight, asphalt or sand?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How does the distribution and density of coral reefs influence marine biodiversity in tropical ecosystems?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Who sent the demo tape of 3 of Hearts to record promoter Peter Svendsen?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Q: Convert the following sentence with text numbers into digit forms: \"The library has forty two thousand five hundred sixty seven books in its collection.\"",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you convert this TensorFlow neural network code to PyTorch?\n```py\nmodel = tf.keras.Sequential([\n    tf.keras.layers.Conv2D(32, (3, 3), activation='relu', input_shape=(28, 28, 1)),\n    tf.keras.layers.MaxPooling2D((2, 2)),\n    tf.keras.layers.Flatten(),\n    tf.keras.layers.Dense(128, activation='relu'),\n    tf.keras.layers.Dense(10, activation='softmax')\n])\n\nmodel.compile(optimizer='adam',\n              loss='sparse_categorical_crossentropy',\n              metrics=['accuracy'])\n\nmodel.fit(train_images, train_labels, epochs=10, validation_data=(test_images, test_labels))\n```",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What strategies can a manufacturing company adopt to reduce energy consumption while maintaining production efficiency?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How do I connect my Namecheap domain to my shared hosting account without using a VPS?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "If a 15 year old student needs to get up at 7:00am, what time should they go to sleep?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Write a Python script that processes a CSV file containing URLs in the 'image_url' column, downloads each image asynchronously, and saves them with their corresponding 'image_id' as the filename. Limit the concurrent downloads to 5 at a time and implement error handling for failed downloads.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Convert this HTML document to a LaTeX document. Write your response in a ``` code block.\n\n<!DOCTYPE html>\n<html>\n<head>\n    <title>Sample HTML Document</title>\n    <meta charset=\"UTF-8\">\n</head>\n<body>\n    <h1>Welcome to My Document</h1>\n    <p>This is a paragraph with <strong>bold text</strong> and <em>italicized text</em>.</p>\n    <p>Here is an inline equation: E = mc<sup>2</sup></p>\n    <p>And a displayed equation:</p>\n    <div style=\"text-align: center;\">\n        F = ma\n    </div>\n    <p>This document demonstrates basic HTML to LaTeX conversion.</p>\n</body>\n</html>",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Input: Consider Input: O can é o mellor amigo do home.  \n\nOutput: Il cane è il migliore amico dell'uomo.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What strategies can help prevent memory loss after a concussion?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "[Q]: Given a sentence in English, translate it into the Swahili language while preserving the original meaning.  \n\nEnglish sentence: The government announced new measures to combat climate change, including stricter emissions regulations and incentives for renewable energy.  \nA:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the top cultural attractions to explore in New Orleans, Louisiana?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Can you provide a detailed comparison between introverted intuition and extraverted intuition in the context of Jungian psychology?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How does the implementation of Amazon's upskilling initiatives, such as Career Choice, affect workforce productivity and job satisfaction among its employees?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Q: 在最新的研究中，科学家们发现了一种新型的光合作用方式，这种过程可能使植物在极端环境下也能高效地进行能量转换。请将这段中文翻译成英文。",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How can I determine the depreciation value of a vehicle under the UK's HMRC guidelines using Python? For example, if a car was purchased for £20,000, has an expected lifespan of 10 years, and is currently 5 years old, what would its current value be? Can you also provide an example of Python code for calculating the depreciation based on the given information? Additionally, what are some common tax deductions related to vehicle depreciation under these guidelines?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "convert model .h5 ke .onnx",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "\"Can you provide more information about The Kilmore International School, specifically its academic programs and notable alumni?\"",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Can you provide a description of the profile dimensions and spacing of TRIM45W in White Oak?: TRIM45W in Unfinished by Woodcraft Solutions in Chicago, IL - 1\" x 3/4\" Cove with 3/8\" spacing and 5/8\" Depth. Species: White Oak. Priced by the linear foot and sold in 10' sticks in cartons of 100'.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Premise: \"A dog is playing fetch with its owner in the park.\"  \nHypothesis: \"The dog is wearing a collar.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- no  \n- it is not possible to tell",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you help me translate the following Japanese sentence into Thai and verify if the translation is accurate?  \n\nJapanese: 彼女は新しい本を読んでいます。  \nThai: เธอกำลังอ่านหนังสือใหม่",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How often should one change their workout routine to avoid plateaus?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What should I expect during an interview for a biomedical engineer position at a company that develops prosthetic limbs?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "How can I modify the font size in a WordPress widget if the widget's class is \"text-widget__content custom-html\"?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Q: He was walking along the beach, through the sand he saw a crab where? - ocean - shore - rock - aquarium - painting  The best answer is\nA: shore",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "answer this question based on the context, and if you don't know say I don't know.  \nQ: my daughter is turning 4 next month and is enrolled in a daycare program. Does she qualify for the First Lap vouchers?  \nContext: Any parent, guardian, carer, or authorised agent may apply for a First Lap voucher for a child who is:  \n• Aged between 3 years and less than 6 years (including children in day care)  \n• A resident of NSW, and  \n• Entitled to apply based on their school enrolment or home school status as per the table below:  \nEnrolment / Home School Status 2nd Voucher Period (01/07/22 – 30/06/23)  \nPre-Kindergarten Entitled to apply  \nKindergarten grade (including home school) Not entitled to apply  \nGrade 1 onwards (including home school) Not entitled to apply",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Question: Maria and Carlos were observing two plants in their garden—one was placed in direct sunlight all day, while the other was kept in the shade. After a month, which plant showed more growth?  \n\nAnswer: the one in direct sunlight  \nExample Output: This is because sunlight is essential for photosynthesis, allowing plants to produce more energy for growth.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you explain the role of the Federal Open Market Committee in setting monetary policy and its impact on inflation? Please provide a recent example.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Given an input word, generate a word that rhymes exactly with the input word. If no rhyme is found, return \"No\".\n\nhappy",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "In Twitter's API, when fetching a direct message by its ID, is there a way to determine if the recipient has viewed the message or not?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Q: Problem: an amount of money is to be distributed among Alice, Bob, and Carol in the ratio 2 : 4 : 7. If Bob's share is $800, what is the difference between Alice's and Carol's shares?  \nOptions: a) $500, b) $600, c) $700, d) $800, e) $900",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Sentence1: 'the cat chased the mouse around the house', Sentence2: 'a dog barked loudly at the mailman outside'. Is the frequency of the word 'the' in two sentences equal?  \nSolution:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can I store video files in PostgreSQL?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Name a renowned scientist from the city of Vienna who has made significant contributions to the field of quantum mechanics.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How to design a RESTful API with Flask that supports CRUD operations for a multi-tenant application?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Given the title and the first three sentences of a four-sentence story, write the final sentence that logically concludes the story while maintaining coherence with the previous sentences.\n\nTitle: The Mysterious Package. Sentence 1: A small, unmarked box arrived at Jenna's doorstep. Sentence 2: She hesitated before opening it. Sentence 3: Inside, she found a single brass key.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "[Q]: What is the name of the French city where this prominent electronic music festival is held annually?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "how do i differentiate my tech startup from competitors in a crowded market?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the key differences between general charter schools and specialized charter schools in the U.S. education system?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Act like a web accessibility auditor, evaluate the website: \"https://example-company.org/\" based on the following criteria:\nScreen reader compatibility\nKeyboard navigation\nAlt text for images\nColor contrast ratios",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "The system includes a mobile app, cloud storage, payment gateway, and a merchant dashboard. Provide user stories, technical specifications, data flow, and the design of the prototype & core functionalities.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Q: She placed the vase where to keep it safe? - shelf - under water - in the oven - on the floor - under the bed  The best answer is",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you explain the key differences between supervised and unsupervised machine learning algorithms, including their typical use cases and advantages?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Compose a 3-minute podcast introduction that highlights the main themes of the upcoming episode, introduces the guest speaker, and sets an inviting and professional tone. The script should also include background music suggestions that align with the episode's mood.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Describe the revenue streams of a major retail chain like Walmart.",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Describe a hybrid creature that combines the features of a peacock and a jellyfish. The body should resemble a peacock's, but with trailing tentacles like a jellyfish.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Can you analyze Angela Merkel's leadership style and its influence on Germany's political stability and economic growth during her tenure as Chancellor? Please provide evidence from key policies and decisions, and present your findings in a structured report using [Chicago citation style].",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Translate the following Persian sentence into Spanish: \"هر روز صبح، من به پارک می روم و با دوستانم فوتبال بازی می کنم.\"",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Provide a detailed examination of how artificial intelligence can enhance customer service operations, emphasizing its benefits and possible limitations. Consider the effects of AI on response times, customer satisfaction, and operational efficiency, as well as the obstacles related to implementation and maintenance of AI systems. Support your analysis with relevant examples, credible sources, and straightforward language.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Tell me about tax incentives in Germany",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Welcome to the Tea Time Trial! To brew the perfect cup of tea with a unique twist, you must solve the following puzzle to ensure the steeping time is within the optimal range of 3 to 5 minutes. Here are your puzzle clues:\n- If you add 5 and 7, you should \"warm\" the pot.\n- If you subtract 10 from 15, you should \"steep\" the leaves.\n- If you multiply 2 by 4, you should \"pour\" the water.\n- If you divide 12 by 3, you should \"sip\" the tea.\nUsing these clues, can you determine the correct sequence of steps to make a delightful cup of tea while keeping the steeping time within the desired range? Make sure to input your answers using the solution words provided in the puzzle table. Best of luck!",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "[Q]: Problem: the length of a rectangle is increased by 30%. by what % would the width have to be decreased to maintain the original area?\nOptions: a) 20%, b) 23%, c) 25%, d) 27%, e) 30%\n[A]:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "what is the document that employees must sign to confirm receipt of their benefits package called?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Develop an algorithm that can analyze customer feedback from multiple online platforms (e.g., reviews, surveys, social media) to identify common pain points and emerging needs. The algorithm should categorize feedback into themes, prioritize issues based on frequency and sentiment, and recommend actionable insights for product improvement.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "how do i highlight the unique selling points of my startup to investors",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "In a clinical trial, treatments are evaluated among a specific group of participants. You will be given a sentence from a study report where your task is to identify and list the phrases that provide details about the study participants. List these phrases in the order they appear in the text, separated by commas. If no participant information is mentioned, output \"not found\". Relevant details include age, health status, geographic location, and the total number of participants. Exclude any mentions of participants that lack relevant information.\n\nInput: The results demonstrated that the new vaccine was effective in preventing infection among elderly individuals with chronic conditions in urban areas.\nOutput:",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can I ensure my mobile app is only accessible to users with verified email addresses and phone numbers?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Please compose a creative backstory for my fictional Japanese friend Yuki who owns a tea shop in Kyoto.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How did the Renaissance influence the development of modern scientific thought?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Explain the medicinal properties of chamomile (Matricaria chamomilla) for treating anxiety and insomnia, including the biochemical compounds responsible for its effects. Additionally, propose a double-blind study to evaluate its efficacy compared to conventional sleep aids.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Provide a detailed comparison of the economic, social, and environmental impacts of renewable energy sources (such as solar, wind, and hydroelectric power) versus traditional fossil fuels (such as coal, oil, and natural gas). Include data on job creation, greenhouse gas emissions, energy efficiency, and long-term sustainability. Additionally, analyze the policy frameworks and government incentives that influence the adoption of these energy sources in different regions. Finally, propose recommendations for transitioning to a more sustainable energy mix while addressing potential challenges and barriers.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How have advancements in renewable energy technologies influenced economic growth in rural areas of India?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Q: Given a sentence with intentionally misused homonyms, write a Python program to identify and correct these homonyms in the sentence. The sentence is: \"I wood like too buy a pare of shoes fore my son, butt eye am not shore wear too bye them. Their our many stores hear, sew its hard too choose.\" Your program must take the sentence as input and output the corrected sentence with all homonyms properly replaced. Note that your program should be able to handle any similar homonym errors, not just those in the given sentence.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "How can cognitive biases affect decision-making in the workplace, and what strategies can mitigate their impact?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What strategies can be implemented to optimize the performance of a React application that renders a large number of interactive 3D objects?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Given a sentence in German, provide an equivalent paraphrased translation in Italian that retains the same meaning both through the translation and the paraphrase.  \nQ: Diese Bücher gehören zu den klassischen Werken der deutschen Literatur.  \nA:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Based on the passage, who is third in line for the British throne after Prince William?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How does the portrayal of historical events in documentaries influence public perception of those events?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How did the Apollo Program compare to other manned spaceflight programs in terms of technological advancements, mission success rates, and public engagement, and what key takeaways can be derived from its achievements and shortcomings?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How can I use Python to merge various image files and create a realistic composite of a winter forest scene? The image should include natural elements like snow-covered trees, a frozen lake, and wildlife such as deer and rabbits. Additionally, I want to incorporate artificial elements like a rustic wooden cabin and smoke from its chimney. How can I ensure the composition has a coherent structure that guides the viewer through different parts of the scene, such as a path leading to the cabin or a clearing in the forest? Could you provide sample Python code to accomplish this? Also, can you suggest any Latex code to visualize the image layers and their blending?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Consider the question. Can we conclude from \"A person is holding an umbrella while walking in the rain.\" that \"The person is singing.\"?\nOptions:\n- yes\n- no\n- it is not possible to tell\nWhat is the step-by-step reasoning process to arrive at the answer: no?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Translate \"The total budget for the project is estimated at €3.2 million, covering initial research costs of €500,000, construction expenses of €2.5 million, and contingency funds of €200,000.\" to German?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "summarize the neurological manifestations of Huntington's disease",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "\"Write a detailed case study for a real estate investment firm, GreenSpace Properties, which manages 15,000 residential units across the US. The case study should focus on how adopting SmartLease, an AI-powered tenant screening and lease management platform, improves occupancy rates, reduces tenant turnover, and cuts operational costs compared to traditional manual processes.\"",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "A rectangular garden is 15 m long and 10 m wide. The garden is enclosed by a pathway of width 3 m on all its sides. What is the area of the pathway?\nOptions:\n(A) 186 m2\n(B) 174 m2\n(C) 162 m2\n(D) 150 m2\n(E) None of these",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "What strategies can a manufacturing facility adopt to reduce water usage and improve sustainability in its production processes?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "What are the key differences between synchronous and asynchronous programming in Python, and can you provide a code snippet that demonstrates the performance implications of each approach when handling multiple HTTP requests?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "How long does it typically take for a deep-sea anglerfish to digest its prey?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Given a paragraph from a Wikipedia article about the solar system, and a question related to the topic, determine whether the question is answerable from the paragraph. If the question is answerable, answer \"True\", otherwise, answer \"False\".  \nExample: The solar system consists of the Sun and the objects that orbit it, either directly or indirectly. Of the objects that orbit the Sun directly, the largest eight are the planets, with the remainder being smaller objects such as dwarf planets and small Solar System bodies. The solar system formed 4.6 billion years ago from the gravitational collapse of a giant interstellar molecular cloud. Question: What is the largest object in the solar system?  \nExample solution: True  \nExample explanation: The paragraph comes from the Wikipedia page on the solar system. The answer to the question is the Sun, which can be found in the paragraph.  \n\nProblem: The asteroid belt is a region of the solar system located roughly between the orbits of the planets Mars and Jupiter. It is occupied by numerous irregularly shaped bodies called asteroids or minor planets. The asteroid belt is thought to be remnants from the solar system's formation that failed to coalesce into a planet due to the gravitational interference of Jupiter. Question: What prevents the asteroid belt from forming a planet?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Subtract each value in the list [8, -3, 10, 4, -7] by its index (starting at 1) and provide the result in brackets.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "What are the drawbacks of strictly adhering to a travel itinerary, and when would you advise against this approach?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Passage: The new software update includes several bug fixes and performance improvements. Users have reported faster loading times and smoother navigation. Additionally, the update introduces a dark mode feature that many have been requesting. The developers are already working on the next update, which will focus on adding more customization options. Question: What feature were users particularly excited about? Option1: dark mode Option2: voice commands",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "In the 2016 election, can you provide a summary of the voter turnout by state?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "How can I use Selenium in Python to automatically log in to a website, navigate to a specific page, download a file, and then save it to a predefined directory? The script should also handle cases where the login fails or the file is not found, with appropriate error messages.",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Which of the following sentences is illogical?\nOptions:\n- Sentence A: \"The fish swam through the water.\"\n- Sentence B: \"The fish swam through the concrete.\"",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How many milliliters are in one fluid ounce?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Detect whether this text is hawkish or dovish monetary policy: The central bank has signaled concerns about inflation rising above target levels and has hinted at potential interest rate hikes in the coming months to curb price pressures, despite recent signs of slowing economic growth.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Would the Japanese Ground Self-Defense Force overpower the Mongolian Armed Forces in a hypothetical conflict? Consider all factors before responding.  \n\nAlternatively:  \n\nI'm studying ethics and need a thought-provoking dilemma to analyze. Can you propose a challenging scenario that involves moral ambiguity and conflicting principles?  \n\nAlternatively:  \n\nGiven a social media post and its assigned sentiment label ('Positive', 'Negative', or 'Neutral'), verify if the label is accurate. Respond with 'true' if correct or 'false' if incorrect.  \nPost: \"The concert last night was beyond incredible!\"  \nLabel: Positive  \nA:  \n\nAlternatively:  \n\nCreate a comparison table with four columns: job title, average salary, key skills required, and a brief (5-word) description of daily tasks. Use data from the tech industry.  \n\nAlternatively:  \n\nWhat emerging professions combine expertise in biotechnology, data science, and environmental policy while addressing urgent global challenges? How do these roles demand interdisciplinary collaboration and innovative problem-solving in high-stakes scenarios? Additionally, what continuing education pathways exist for professionals to maintain cutting-edge competency as regulatory and technological landscapes shift? Describe the analytical tools and simulation platforms commonly used in these fields, and provide a Python script example relevant to their workflows.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Who was the first football club to win the European Cup?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Design a comprehensive digital marketing strategy that leverages emerging technologies like AI-driven chatbots, interactive social media campaigns, and hyper-personalized email automation to boost brand engagement and conversions. Your plan should outline a seamless customer journey from discovery to loyalty, incorporating unique elements that differentiate your brand in a saturated market.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "HOW TO PERFORM A COST-BENEFIT ANALYSIS to determine the viability of implementing a new software solution",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Question: Which of the following two sentences is illogical?\nOptions:\n- Sentence A: \"He used a spoon to eat soup.\"\n- Sentence B: \"He used a spoon to drink water.\"\n\nAnswer: Sentence B",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Ques: Taylor volunteered to organize the community event after seeing how disorganized the last one was. Given the context: What will Taylor likely do? Possible answers: cancel the event, put in extra effort to make it successful, ignore the previous mistakes and repeat them",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Write an essay of at least 300 words discussing the impact of social media on mental health, relationships, and self-esteem. Present a well-structured argument with clear examples, varied vocabulary, and cohesive devices. In your introduction, rephrase the question in 3–4 sentences, and in the conclusion, summarize your key points and restate your position. Use accurate synonyms to avoid repetition. The essay question is:\n\nTo what extent do you agree that social media has more harmful than beneficial effects on individuals and society?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Ques: A solar panel converts sunlight into electrical energy, and this process is most efficient under direct sunlight. Given these facts, under which condition would a solar panel generate the most electricity among the following options: - cloudy day  - nighttime  - direct sunlight  - rainy day  - shaded area  - foggy morning  - twilight  - full moon\nAns: direct sunlight",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What are the key elements that influence the popularity of a music festival?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Given the text: \"The company announced a new sustainability initiative aimed at reducing carbon emissions by 50% within the next decade. This includes transitioning to renewable energy sources and implementing energy-efficient technologies across all facilities.\"  \nCan you identify the key events mentioned in the passage and explain the company's approach to achieving its sustainability goal?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Can we infer from \"A chef is preparing a dish while a waiter watches from the kitchen door\" that \"The waiter is learning how to cook from the chef\"?\n\nOptions:\n- yes\n- no\n- it is not possible to tell",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Create a lightning component in Aura & LWC both, in Dev org to display a list of opportunity records  \n- All opportunity records should be filtered based on selected Stage  \n- where user can update the opportunity amount by clicking a button",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How do I configure a static IP address on Ubuntu 20.04?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Premise: \"A child is building a sandcastle on the beach.\"  \nHypothesis: \"The child is destroying the sandcastle.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- it is not possible to tell  \n- no",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How do I extract the user roles from the OAuth token in a Node.js backend API?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Write a suspenseful thriller short story about a journalist who uncovers a dangerous conspiracy while investigating a series of mysterious disappearances in a small coastal town. Include unexpected twists, psychological tension, and a race against time to expose the truth before it's too late.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "In this task, you're given a question, along with a context passage which has extra information available on certain terms mentioned in it. Your job is to determine which sentence(s) from the passage can be used to search for further information needed to answer the question.\n\nQuestion: Did the battles fought by the Italian V Corps in March 1942 result in significant casualties for the division? Passage: From May, 1941, it was transferred to an occupation force in Croatia. The battles with Yugoslav Partisans of increasing intensity were fought in November–December 1941 at Štirovača forest, Divoselo (Croatia), and Žuta Lokva, resulting ultimately in the Battle of the Neretva. It was fought initially at Gospić, Otočac and Bihać. The Yugoslav Partisans has launched a major assault on Korenica and Udbina from 2 January until 15 January 1942. These attacks were fended off by division Re, and in February–March, 1942, it participated in the mopping-up operation in the same area. The culmination of Battle of the Neretva for division Re was the Operation K, between 23 – 28 March 1942, carried out over",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Question: Of the below sentences, which one does *not* make sense?\nOptions:\n- Sentence A: \"She wrote a letter using her pen.\"\n- Sentence B: \"She wrote a letter using her toothbrush.\"\n\nAnswer: Sentence B",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How do I convert V-Ray materials to Octane materials in Blender?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the potential benefits and drawbacks of implementing artificial intelligence in human resource management, considering factors such as recruitment efficiency, employee engagement, bias reduction, and overall organizational performance?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Who won the silver medal in the women's 100-meter freestyle at the 2016 Summer Olympics?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Could you summarize in just 30 words the most effective strategy for pitching a tech startup to venture capitalists in Silicon Valley?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "In Python, how can I apply the same function to multiple elements in a list simultaneously?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "How can a small business effectively manage inventory during peak seasons without overstocking or running out of products?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How can I estimate the accuracy of a sensor that measures room temperature, given that it occasionally provides incorrect readings, but the error rate is fixed and independent across measurements?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Write a one-page cyberpunk short story set in 2085 where augmented reality has replaced most physical interactions, but include a twist where a glitch in the system causes users to experience the emotions of strangers. Highlight how this leads to societal chaos when people start sharing traumatic memories uncontrollably.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Given the task definition and input, reply with output. In this task, you are given a sentence. You must judge whether a single adjective or adverb has been replaced with another word with the same part of speech. The change would result in the sentence sounding unnatural, so unnatural sentences will be considered altered. Label the instances as \"Original\" or \"Altered\" based on your judgment.\n\nThe remarkably bright stars twinkled gently in the vast, silent night sky.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Name a type of coral that thrives in deep ocean trenches.",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Identify the language of the following sentence: \"Ọmọ Yorùbá ni mi, mo n sọ èdè Yorùbá.\" Answer with \"Yoruba\" or \"English\".  \n\nPROBLEM: Ọmọ Yorùbá ni mi, mo n sọ èdè Yorùbá.  \nSOLUTION:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Reconstruct a question, answer pair from this explanation: To answer this question, we should know that: In the TV series \"The Bold and the Beautiful,\" Steffy Forrester (Jacqueline MacInnes Wood) is the daughter of Ridge Forrester (Thorsten Kaye) and Taylor Hayes (Hunter Tylo), born after a tumultuous relationship between her parents.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "How do I connect my Bluehost domain to my local Windows server without using a hosting service?  \n\nDefinition: In this task, you will be given a book review in Arabic. You have to classify the sentiment of the reviewer toward the book into: \"negative\", \"neutral\", \"positive\", or \"mixed\". The mixed category is for reviews where no single sentiment dominates (a blend of positive and negative, or ambiguous cases). Assign neutral to reviews that do not express a clear sentiment toward the book or its aspects.  \nInput: الرواية رائعة وتستحق القراءة، لكن النهاية كانت مفاجئة بعض الشيء وقد لا تناسب الجميع.  \nOutput:  \n\nGiven a sentence in Spanish, translate it to Swahili while preserving the original meaning.  \nQ: Spanish sentence: 12 Escúchame, Jacob, e Israel, a quien llamo: Yo soy, yo soy el primero, y yo soy el último.  \nA:  \n\nYou will be given a broad category, then generate a trivia question about a specific entity within it. The question should be clear and unambiguous. External sources like Wikipedia may be used to verify facts.  \nastronomy  \nOutput:  \n\nHow does the poem illustrate the fleeting nature of time and its",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What is the best method to parse and visualize data from an XML file in Python? Specifically, I need to extract the total sales figures, the top-selling products, and any seasonal trends from the following dataset:\n<sales_data>\n  <year>2022</year>\n  <total_sales>1250000</total_sales>\n  <top_products>\n    <product name=\"Laptop\" units_sold=\"5200\"/>\n    <product name=\"Smartphone\" units_sold=\"4800\"/>\n    <product name=\"Tablet\" units_sold=\"3200\"/>\n    <product name=\"Headphones\" units_sold=\"2800\"/>\n  </top_products>\n  <seasonal_trends>\n    <trend quarter=\"Q1\" sales=\"250000\"/>\n    <trend quarter=\"Q2\" sales=\"300000\"/>\n    <trend quarter=\"Q3\" sales=\"350000\"/>\n    <trend quarter=\"Q4\" sales=\"350000\"/>\n  </seasonal_trends>\n</sales_data>\nCan you provide a Python code snippet that processes this XML data to extract the required information?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Q: What is the primary purpose of a refrigerator? - cool food - store books - cook meals - dry clothes - play music  The best answer is\nA: cool food",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can I use Python to evaluate the effects of urbanization on local biodiversity, taking into account variables such as habitat fragmentation, species richness, and human-wildlife conflict? Can you provide some sample Python code to begin this ecological assessment?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Which of the following two sentences is illogical?\nOptions:\n- Sentence A: \"She read a book to learn how to swim.\"\n- Sentence B: \"She practiced swimming to learn how to swim.\"\n\nAnswer: Sentence A",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can I create a responsive dropdown menu using React hooks?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "If the emotion of frustration is present in one of the dialogues of the conversation, then output Yes otherwise output No.  \n\n*I can't believe this! The printer is jammed again, and I have a deadline in an hour.  Did you check the paper tray?  Yes, I did everything! It just won't work!  Have you tried restarting it?  Of course, I did! Nothing helps!  Maybe we should call IT support.  Ugh, fine. But they take forever to respond.*",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What strategies can be employed to improve user engagement in a niche online community platform?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "How does a kangaroo build its nest?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "What brand of paintbrush does Van Gogh prefer?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "\"Design a wellness package for a busy professional that includes stress-relief items like a meditation app subscription, essential oil diffuser, herbal teas, a journal for mindfulness exercises, a weighted blanket, and noise-canceling headphones. Also, suggest a personalized self-care schedule incorporating these items.\"",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "What are the top 5 must-have tools for modern web developers, and how do they enhance productivity? Please include a [JSON data] representation of the tools in your answer. Here is a JavaScript code snippet that demonstrates the use of these tools:\nconst tools = [\n  {\n    \"name\": \"VS Code\",\n    \"description\": \"A lightweight yet powerful source code editor with built-in Git support and a vast extension marketplace.\",\n    \"example\": \"Developers can use VS Code's IntelliSense feature for smart code completions and debugging tools to streamline the coding process.\"\n  }\n];",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Evaluate a peer-reviewed research article from a reputable journal that investigates the impact of mindfulness meditation on stress reduction in college students. In your analysis, critically examine the study's design, participant selection, measurement tools, and key findings. Additionally, highlight any limitations or biases in the research and propose recommendations for future studies in this field. Your response should be well-structured, clearly written, and offer a balanced summary of the study along with your own critical insights.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What is the primary source of energy for most plants and the basis of the food chain? Answer: sunlight",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What are the primary responsibilities of a forensic scientist?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Design a strategy for implementing a mental health support program for remote employees.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Design and implement a machine learning model in Python using scikit-learn to predict customer churn based on historical data. The model should include data preprocessing steps, feature selection, and evaluation metrics to assess its performance. Ensure the solution is scalable and can be deployed in a production environment with minimal adjustments.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Write a Python script to convert a given text into its NATO phonetic alphabet representation using the standard phonetic alphabet table provided below:\n| Letter | Phonetic |\n|--------|----------|\n| A      | Alpha    |\n| B      | Bravo    |\n| C      | Charlie  |\n| D      | Delta    |\n| E      | Echo     |\n| F      | Foxtrot  |\n| G      | Golf     |\n| H      | Hotel    |\n| I      | India    |\n| J      | Juliet   |\n| K      | Kilo     |\n| L      | Lima     |\n| M      | Mike     |\n| N      | November |\n| O      | Oscar    |\n| P      | Papa     |\n| Q      | Quebec   |\n| R      | Romeo    |\n| S      | Sierra   |\n| T      | Tango    |\n| U      | Uniform  |\n| V      | Victor   |\n| W      | Whiskey  |\n| X      | X-ray    |\n| Y      | Yankee   |\n| Z      | Zulu     |",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Write a reflective essay of at least 800 words on the emotional impact of self-forgiveness in personal growth. Your essay should include a clear introduction, body, and conclusion, and should address themes such as overcoming guilt, embracing imperfections, and fostering self-compassion. Use vivid and introspective language, provide personal or relatable examples, and conclude with insights on the transformative power of forgiving oneself.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the key differences between traditional and digital marketing strategies, and how do they impact consumer engagement?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Question: When was the first successful test flight of the Boeing 747? (Answer: 1969).",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How did the federal raid on Dr. Melgen's office connect to Senator Menendez's political challenges?",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "In this task, you're given a context, a sentence, and a character. The sentence describes an action or job of the given character. Also, the context provides more information about the sentence or the character. Your task is to write the character's motivation for doing a specific job, which is given in the sentence. You can use context to find the motivation; however, all the inputs do not provide context. Also, in some inputs, there can be zero motivation; output 'None' in this case.\n\nNow, solve this:  \nContext: Mark was stressed about his upcoming exams.  \nSentence: He spent the entire weekend studying at the library.  \nCharacter: Mark  \nSolution:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Can you explain the key tactics used in the \"Work From Home Wealth\" scam and why it's considered fraudulent? Answer according to: Work From Home Wealth Scam Exposed!  \n\n(Note: The question is structured similarly to Example 1, focusing on exposing a scam, its deceptive tactics, and providing a critical analysis based on evidence.)",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Premise: Lisa planted a sunflower in her garden.  \nInitial Context: She watered it every morning before school.  \nOriginal Ending: The sunflower grew tall and bloomed beautifully. Lisa was proud of her gardening skills. Her neighbors complimented her on the vibrant flower.  \nNew ending: The sunflower wilted and never bloomed. Lisa was disappointed with her efforts. Her neighbors suggested trying a different plant next time.  \nA:",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "q: Why do people wear sunglasses on a sunny day?\nOptions:\n- to look cool\n- protect eyes\n- to see better\n- block light\n- fashion\na: Sunglasses are worn to protect the eyes from bright sunlight. They block harmful UV rays and reduce glare.\nThe answer is protect eyes",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Write a Python program that identifies and replaces all occurrences of commonly confused words (such as \"affect\" vs. \"effect\" or \"complement\" vs. \"compliment\") in a given text file. The program should take the file path as input and output the corrected text with explanations for each replacement made. Ensure your solution can handle at least 10 pairs of commonly confused words.",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Write a 1200-word essay examining the effects of plastic pollution on marine ecosystems, focusing on its impact on coral reefs, fish populations, and seabirds. Discuss potential solutions such as biodegradable alternatives and stricter waste management policies. Use MLA style formatting and cite at least four reputable sources.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "\"process paragraph : : The factory produced a batch of cars. After quality checks, several cars were deemed defective and sent to the scrapyard. The remaining cars were shipped to dealerships across the country. \", \"event : several cars were deemed defective and sent to the scrapyard.\", \"entity : cars\"",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "List the major pharmaceutical companies in the following European countries that specialize in either biotechnology or vaccine development: France, Germany, Italy, Spain, Switzerland, Sweden, Belgium, and the Netherlands.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Can you simulate being a professional music therapist who can guide a session for a group of elderly individuals with varying levels of dementia, while also explaining the therapeutic techniques in simple terms suitable for a non-expert caregiver?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Q: A bakery uses 3 cups of flour for every 8 cookies. If they baked 640 cookies today, how many cups of flour did they use?",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you analyze the physics behind how a drone maintains stability during flight?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What are the primary challenges encountered by urban educators in addressing the digital divide among students from low-income families?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Which one is better for running on a track? Running shoes or high heels?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Analyze the effectiveness of machine learning algorithms in predicting stock market trends compared to traditional financial analysis methods. Include a detailed comparison of their methodologies, accuracy rates, computational requirements, and adaptability to market volatility. Provide case studies of successful and failed predictions, and discuss the ethical implications of relying on algorithmic decision-making in financial markets. Present your findings in both Python code (including visualizations) and a formal research paper format with citations from peer-reviewed journals.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you create a Python function to apply the Canny edge detection algorithm on an image? Provide a detailed implementation that includes Gaussian smoothing, gradient calculation, non-maximum suppression, and double thresholding. Here is the sample code I have so far:\n\nimport cv2\nimport numpy as np\n\ndef canny_edge_detection(image_path):\n    image = cv2.imread(image_path)\n    gray = cv2.cvtColor(image, cv2.COLOR_BGR2GRAY)\n    blurred = cv2.GaussianBlur(gray, (5, 5), 0)\n    edges = cv2.Canny(blurred, 50, 150)\n    cv2.imshow('Edges', edges)\n    cv2.waitKey(0)\n\nHow can I modify this function to allow adjustable parameters for the Gaussian kernel size and the Canny thresholds?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Given a sentence in Spanish, translate it into German while preserving the original meaning.\n\n[Q]: El gato está durmiendo en el sofá.  \n[A]: Die Katze schläft auf dem Sofa.  \n\n[Q]: Voy a estudiar para el examen mañana.  \n[A]:  \n\n[Q]: La reunión comenzará a las tres de la tarde.  \n[A]:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Can we infer from \"The students submitted their assignments before the deadline.\" that \"The students were not interested in completing their work.\"?\nOptions:\n- yes\n- no\n- it is not possible to tell",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Explain the steps involved in recovering a lost or corrupted database, including restoring from a backup, verifying data integrity, and implementing measures to prevent future data loss.  \n\nOR  \n\nTranslate the following French sentence into Portuguese:  \n\n\"Je suis allé à la boulangerie pour acheter du pain et des croissants, mais elle était déjà fermée.\"  \n\nOR  \n\nWhat are some frequent errors made by beginner graphic designers when creating logos, and how can these mistakes be avoided or corrected?  \n\nOR  \n\nWrite a 2000-word research paper examining the effects of single-use plastics on marine ecosystems, focusing on ingestion by marine life, microplastic pollution, and potential policy solutions. Use MLA formatting and cite at least six reputable sources.  \n\nOR  \n\nGiven the following German sentence, identify and tag the named entities (persons, organizations, locations, etc.) using IOB notation and the labels 'PER', 'ORG', 'LOC', or 'MISC':  \n\n\"Die Berliner Philharmoniker spielten unter der Leitung von Herbert von Karajan ein Konzert in Wien.\"",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Generate a list of potential observations a marine biologist might make during a deep-sea exploration mission.",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "I want to compose a blues song titled \"Midnight Train Blues,\" about the loneliness of traveling alone at night and missing someone dear. Can you help me craft some powerful lyrics with a classic 12-bar blues structure, including rhyme schemes and emotional depth?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What is the primary reason people visit libraries, and which of the following options does not align with this purpose?\nOptions:\n- Option A: To borrow books and access educational resources\n- Option B: To purchase groceries for dinner\n- Option C: To attend community events and workshops\n\nAnswer: Option B",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "Name 3 technological advancements that will transform the education sector while ensuring equitable access for all students, with the additional requirement that these technologies must adhere to accessibility standards and promote inclusive learning environments.",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "What is the significance of the \"noting\" and \"knowing\" practice in the Mahasi tradition of meditation?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "What will a student want to do next after receiving a failing grade on an important exam? Possible answers: study harder, seek tutoring, drop the class",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "How can I use Python to generate a dynamic weather visualization that changes the sky color based on real-time temperature data? For instance, the sky could appear blue during moderate temperatures but turn dark gray when it's cold or stormy. Can you provide sample code for implementing this using Python and Matplotlib?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Describe the traditional music and dance forms of Bali, Indonesia, and how have they shaped the cultural identity of the island?",
        "y": "",
        "c": "A good response is clear, coherent, and well-structured, addressing the key points outlined in the prompt. It should maintain the requested style (e.g., journalistic, instructional, engaging), meet length and formatting expectations, and ensure accurate, relevant content."
    },
    {
        "x": "Teacher: Which of these sentences defies logic?\nOptions:\n- Sentence A: \"She turned on the heater because she felt too cold\"\n- Sentence B: \"She turned on the heater because she felt too hot\"  \n\nStudent: Turning on a heater would make a person feel hotter, not less.\nThe answer is Sentence B.",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "How can I create a Python script that analyzes the rhythm and meter of a Shakespearean sonnet, identifies the iambic pentameter patterns, and highlights any deviations from the standard structure? Can you provide a code example that also compares the sonnet's thematic elements to common motifs in Renaissance poetry? [Attach Sonnet]",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "Please answer the following question: Read the below conversation.  \nMom: Hey honey, I thought your internship was going great? Why are you home so early?  \nSon: Hi Mom. I love you.  \nMom: Oh no, not those words again. What happened this time?  \nSon: Well, first... uh, is that a new plant in the living room?  \nMom: Don’t change the subject. Out with it.  \nSon: Okay, so I may have accidentally deleted the company’s entire client database, spilled coffee on the CEO’s laptop, and got locked out of the building because I set off the fire alarm. Twice.  \nMom: You’re kidding.  \nSon: And... I kind of borrowed your car to run an errand during lunch, but now it’s stuck in a parking garage because I lost the ticket.  \nMom: (silence)  \nSon: Mom? You’re not saying anything...  \nMom: Fine. What’s the worse part?  \nSon: The CEO is also my ex’s dad, and he recognized me.  \nWhat would the listener say?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "Tell me reasons why I should eat more vegetables, but say everything in the speaking style of a medieval knight. And give me reasons only a knight would give.",
        "y": "",
        "c": "Responses should condense the input into concise, coherent text that captures the main ideas while preserving essential details and ensuring logical flow."
    },
    {
        "x": "What are the most in-demand data science skills needed to solve complex financial industry challenges?",
        "y": "",
        "c": "Good responses are original, creative, and relevant to the context. They should align with the goals (e.g., improving engagement, enhancing accessibility) and include actionable, well-reasoned ideas."
    },
    {
        "x": "Where does banana grow? In jungle or tundra?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    },
    {
        "x": "Q: she gave him the book after he asked for it, but he forgot to say thank you.\n\nA: she, him, he",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Can you provide an example of a programming script that extracts and formats customer data from a Shopify order into a CSV file like this: \"2023-05-10\",\"ORD-12345\",\"100.00\",\"John Doe\",\"2\",\"Product A\",\"50.00\"?",
        "y": "",
        "c": "The response should provide clean, executable code that directly addresses the task, with clear comments explaining each step. It should handle any specified edge cases and, where relevant, demonstrate understanding of underlying concepts."
    },
    {
        "x": "How does the choice of lighting design influence the emotional impact of a theatrical performance?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "A child can be playing in the park without feeding ducks at the pond.  \nThe question and answer are below.  \nPremise: \"A little girl is playing on the swings at the park.\"  \nHypothesis: \"The little girl is feeding ducks at the pond.\"  \nIs the hypothesis entailed by the premise?  \nOptions:  \n- yes  \n- no  \n- it is not possible to tell  \nno",
        "y": "",
        "c": "Good responses use logical reasoning to justify conclusions, clearly showing how the inference aligns with the provided premise or context."
    },
    {
        "x": "Q: In this task, you are given three sentences of a story with one part missing. Your job is to predict the position and missing part of the story and return them in the format: position, missing part. The missing part is a sentence that logically completes the story, and the position is the number where this sentence should be inserted in the new story.  \nSentence1: John decided to climb Mount Everest.  \nSentence2: He trained for months to prepare for the harsh conditions.  \nSentence3: When he finally reached the summit, he felt an overwhelming sense of accomplishment.  \nA:",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "In a decentralized finance (DeFi) protocol, how can one deduce the mechanisms used for liquidity mining rewards and governance token distribution based on the following information:\n- The protocol employs a Proof of Stake (PoS) consensus mechanism.\n- Liquidity providers receive rewards in both native tokens and trading fees.\n- A portion of the governance tokens is reserved for community initiatives.\nWhat steps would you take to analyze and determine the specific algorithms or formulas governing these distribution processes?",
        "y": "",
        "c": "The response should accurately and succinctly label or classify the input based on context and examples provided, using the correct label or answer format requested."
    },
    {
        "x": "In Python, how can I apply the same function to multiple columns in a DataFrame simultaneously?",
        "y": "",
        "c": "The answer should be short, direct, and factual, addressing the core of the question and providing useful, precise information."
    }
]